app/views/questions/index.html.erb


  <% question.options.each do |option| %>
---
SELECT "options".* FROM "options" WHERE "options"."question_id" = ?  [[nil, 1]]