app/views/questions/show.html.erb

  <br>
  <% @question.options.each do |option| %>
---
SELECT "options".* FROM "options" WHERE "options"."question_id" = ?  [[nil, 1]]