app/views/quizzes/show.html.erb

  <td><%= link_to "Add a Question", :controller=>'questions',:action=>'new',:quiz_id=>@quiz.id  %><%= @quiz.id %><td>
  <% @quiz.questions.all.each do |question| %>
---
SELECT "questions".* FROM "questions" WHERE "questions"."quiz_id" = ?  [[nil, 1]]

  <br>
  <% question.options.each do |option| %>
---
SELECT "options".* FROM "options" WHERE "options"."question_id" = ?  [[nil, 8]]