app/views/welcome/index.html.erb

<form action = "/welcome/evaluate_score" method="post">
    <% @quiz.questions.each do |question| %>
---
SELECT "questions".* FROM "questions" WHERE "questions"."quiz_id" = ?  [[nil, 2]]


  <% question.options.each do |option| %>
---
SELECT "options".* FROM "options" WHERE "options"."question_id" = ?  [[nil, 1]]