app/controllers/options_controller.rb

  def index
    @options = Option.all
---
SELECT "options".* FROM "options"

  def show


   #find the option id
    a=params[:id]
    #find the option
    o=Option.find(a)
    #Find the question id
    z=o.Question.id
    #Find the Question
    question=Question.find(z)
---
SELECT  "options".* FROM "options" WHERE "options"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]

  def create

    puts option_params
    @option = Option.new(option_params)
    puts @option.Question_id

    respond_to do |format|
      if @option.save
---
INSERT INTO "options" ("Question_id", "correct", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["Question_id", 1], ["correct", "f"], ["text", "Vaibhav SInghal"], ["created_at", "2017-03-29 07:27:14.026956"], ["updated_at", "2017-03-29 07:27:14.026956"]]

    def set_option
      @option = Option.find(params[:id])
---
SELECT  "options".* FROM "options" WHERE "options"."id" = ? LIMIT 1  [["id", 14]]