app/controllers/questions_controller.rb

  def show

    #find the id of the question
    q_id=params[:id]
    #find the question by question id
    q=Question.find(q_id)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 2]]

  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("text", "created_at", "updated_at") VALUES (?, ?, ?)  [["text", "Who is the chief minister of uttar pradesh"], ["created_at", "2017-03-29 07:19:20.137951"], ["updated_at", "2017-03-29 07:19:20.137951"]]

  def destroy
    @question.destroy
---
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 1]]