app/controllers/welcome_controller.rb

  def index
    @quiz=Quiz.find(params[:quiz_id])
  	@questions=Question.all
---
SELECT "questions".* FROM "questions"

  def evaluate_score

  	@totalscore=0
    @quiz_id=params[:quiz_id]
    @quiz=Quiz.find(@quiz_id)
    @questions=Question.all
   @questions.each do |question|
   x=params[question.id.to_s]

  if x!=nil
   	option=Option.find(x)
---
SELECT "questions".* FROM "questions"
SELECT  "options".* FROM "options" WHERE "options"."id" = ? LIMIT 1  [["id", 1]]